In [30]:
import pandas as pd
import numpy as np
data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

##### Write a Pandas program to create a dataframe by given dictionary and index as lables

In [31]:
### code here
df = pd.DataFrame(data, index=labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 1. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [32]:
### code here
df = pd.DataFrame(data, labels)
df = df.sort_values(by=['name', 'score'], ascending=[False, True])
print(df)

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

###### 2. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [33]:
### code here
df["qualify"] = df["qualify"].map({"yes": True, "no": False})
print(df)

        name  score  attempts  qualify
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
c  Katherine   16.5         2     True
j      Jonas   19.0         1     True
d      James    NaN         3    False
e      Emily    9.0         2    False
b       Dima    9.0         3    False
a  Anastasia   12.5         1     True

#####3. Write a Pandas program to delete the 'attempts' column from the DataFrame

In [34]:
### code here
df = df.drop('attempts', axis=1)

print(df)

        name  score  qualify
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
c  Katherine   16.5     True
j      Jonas   19.0     True
d      James    NaN    False
e      Emily    9.0    False
b       Dima    9.0    False
a  Anastasia   12.5     True

##### 4. Write a Pandas program to insert a new column in existing DataFrame.

In [35]:
### code here
df["kiran"]=None
df

        name  score  qualify kiran
f    Michael   20.0     True  None
g    Matthew   14.5     True  None
h      Laura    NaN    False  None
i      Kevin    8.0    False  None
c  Katherine   16.5     True  None
j      Jonas   19.0     True  None
d      James    NaN    False  None
e      Emily    9.0    False  None
b       Dima    9.0    False  None
a  Anastasia   12.5     True  None

##### 5. Write a Pandas program to change the name 'James' to 'Maxwell' in name column of the DataFrame.

In [36]:
### code here
df.name.str.replace("James","Maxwell")

f      Michael
g      Matthew
h        Laura
i        Kevin
c    Katherine
j        Jonas
d      Maxwell
e        Emily
b         Dima
a    Anastasia
Name: name, dtype: object

##### 6. Write a Pandas program to rename columns of a given DataFrame

In [37]:
### code here
df.rename(columns={"name":"NAME","score":"SCORE","qualify":"QUALIFY","kiran":"KIRAN"},inplace=True)

In [38]:
df

        NAME  SCORE  QUALIFY KIRAN
f    Michael   20.0     True  None
g    Matthew   14.5     True  None
h      Laura    NaN    False  None
i      Kevin    8.0    False  None
c  Katherine   16.5     True  None
j      Jonas   19.0     True  None
d      James    NaN    False  None
e      Emily    9.0    False  None
b       Dima    9.0    False  None
a  Anastasia   12.5     True  None

##### 7. Write a Pandas program to convert the datatype of a given column (floats to ints).

In [39]:
### code here 
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, f to a
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   NAME     10 non-null     object
 1   SCORE    8 non-null      float64
 2   QUALIFY  10 non-null     bool
 3   KIRAN    0 non-null      object
dtypes: bool(1), float64(1), object(2)
memory usage: 630.0+ bytes

In [40]:
df["SCORE"].fillna(-1, inplace=True)
df["SCORE"]=df["SCORE"].astype(int)

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, f to a
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   NAME     10 non-null     object
 1   SCORE    10 non-null     int32
 2   QUALIFY  10 non-null     bool
 3   KIRAN    0 non-null      object
dtypes: bool(1), int32(1), object(2)
memory usage: 590.0+ bytes

###### 8.  Write a Pandas program to convert index in a column of the given dataframe.

In [42]:
### code here 
df.reset_index(inplace=True)
df.rename(columns={'index': 'ID'}, inplace=True)

In [43]:
df

  ID       NAME  SCORE  QUALIFY KIRAN
0  f    Michael     20     True  None
1  g    Matthew     14     True  None
2  h      Laura     -1    False  None
3  i      Kevin      8    False  None
4  c  Katherine     16     True  None
5  j      Jonas     19     True  None
6  d      James     -1    False  None
7  e      Emily      9    False  None
8  b       Dima      9    False  None
9  a  Anastasia     12     True  None

##### 9. Write a Pandas program to shuffle a DataFrame rows.

In [44]:
### code here
df = df.sample(frac=1).reset_index(drop=True)
df

  ID       NAME  SCORE  QUALIFY KIRAN
0  a  Anastasia     12     True  None
1  f    Michael     20     True  None
2  c  Katherine     16     True  None
3  d      James     -1    False  None
4  j      Jonas     19     True  None
5  i      Kevin      8    False  None
6  g    Matthew     14     True  None
7  e      Emily      9    False  None
8  h      Laura     -1    False  None
9  b       Dima      9    False  None

##### 10 Write a Pandas program to write a DataFrame to CSV file using tab separator

In [48]:
### code here
df.to_csv('data.csv', sep='\t', index=False)

In [46]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

#####11. Write a Pandas program to join the two given dataframes along rows and assign all data.

In [47]:
### code here
pd.concat([student_data1,student_data2],axis=0)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

##### 12. Write a Pandas program to join the two given dataframes along columns and assign all data.

In [49]:
### code here
pd.concat([student_data1,student_data2],axis=1)

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

##### 13. Write a Pandas program to join the two dataframes using the common column of both dataframes.

In [50]:
### code here
pd.merge(student_data1, student_data2, on='student_id')

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

###### 14. Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

In [51]:
#### code here
pd.merge(student_data1, student_data2, on='student_id',how="left")

  student_id            name_x  marks_x            name_y  marks_y
0         S1  Danniella Fenton      200               NaN      NaN
1         S2      Ryder Storey      210               NaN      NaN
2         S3      Bryce Jensen      190               NaN      NaN
3         S4         Ed Bernal      222  Scarlette Fisher    201.0
4         S5       Kwame Morin      199  Carla Williamson    200.0

###### 15. Write a Pandas program to join two dataframes using keys from right dataframe only.

In [52]:
### code here
pd.merge(student_data1, student_data2, on='student_id',how="right")

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal    222.0  Scarlette Fisher      201
1         S5  Kwame Morin    199.0  Carla Williamson      200
2         S6          NaN      NaN       Dante Morse      198
3         S7          NaN      NaN    Kaiser William      219
4         S8          NaN      NaN   Madeeha Preston      201

In [54]:
df=pd.read_csv("ufo_sighting_data.csv")
df

C:\Users\pamar\AppData\Local\Temp\ipykernel_18752\615119962.py:1: DtypeWarning: Columns (5,9) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("ufo_sighting_data.csv")

,Date_time,city,state/province,country,UFO_shape,length_of_encounter_seconds,described_duration_of_encounter,description,date_documented,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.9783333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.4180556,-157.803611
...,...,...,...,...,...,...,...,...,...,...,...
80327,9/9/2013 21:15,nashville,tn,us,light,600.0,10 minutes,Round from the distance/slowly changing colors...,9/30/2013,36.165833,-86.784444
80328,9/9/2013 22:00,boise,id,us,circle,1200.0,20 minutes,Boise&#44 ID&#44 spherical&#44 20 min&#44 10 r...,9/30/2013,43.613611,-116.202500
80329,9/9/2013 22:00,napa,ca,us,other,1200.0,hour,Napa UFO&#44,9/30/2013,38.297222,-122.284444
80330,9/9/2013 22:20,vienna,va,us,circle,5.0,5 seconds,Saw a five gold lit cicular craft moving fastl...,9/30/2013,38.901111,-77.265556
80331,9/9/2013 23:00,edmond,ok,us,cigar,1020.0,17 minutes,2 witnesses 2 miles apart&#44 Red &amp; White...,9/30/2013,35.652778,-97.477778

###### import UFO dataset

######16. Write a Pandas program to create the todays date.

In [55]:
### code here
import datetime
today_date = datetime.date.today()
print(today_date)

2023-01-27

###### 17. Write a Pandas program to get the current date, oldest date and number of days between Current date and oldest date of Ufo dataset.

In [61]:
#### code here
import pandas as pd


# Extract the 'datetime' column
dates = df['Date_time']

# Replace 24 with 0 in the hour value
dates = dates.str.replace("24:", "00:")

# Convert the column to datetime data type
dates = pd.to_datetime(dates)

# Get the current date
current_date = pd.to_datetime('today').date()

# Get the oldest date from the 'datetime' column
oldest_date = dates.min().date()

# Calculate the number of days between the current date and oldest date
days_diff = (current_date - oldest_date).days

print("Current date: ", current_date)
print("Oldest date: ", oldest_date)
print("Number of days between current date and oldest date: ", days_diff)

C:\Users\pamar\AppData\Local\Temp\ipykernel_18752\2623920360.py:5: DtypeWarning: Columns (5,9) have mixed types. Specify dtype option on import or set low_memory=False.
  ufo_data = pd.read_csv("ufo_sighting_data.csv")

Current date:  2023-01-27
Oldest date:  1906-11-11
Number of days between current date and oldest date:  42446

###### 18. Write a Pandas program to get all the info of the dataframe between 1950-10-10 and 1960-10-10.

In [65]:
### code here 
dates = df['Date_time']
dates = dates.str.replace("24:", "00:")


# Convert the column to datetime data type
dates = pd.to_datetime(dates)

# Set the date range
start_date = pd.to_datetime("1950-10-10")
end_date = pd.to_datetime("1960-10-10")

# Filter the DataFrame based on the date range
ufo_data_filtered = ufo_data[(dates >= start_date) & (dates <= end_date)]

# Print the filtered DataFrame
print(ufo_data_filtered)

              Date_time                  city state/province country  \
2      10/10/1955 17:00  chester (uk/england)            NaN      gb
3      10/10/1956 21:00                  edna             tx      us
480     10/1/1952 03:30       fukuoka (japan)            NaN     NaN
481     10/1/1952 12:00           kansas city             mo      us
482     10/1/1954 19:00             flatwoods             wv      us
...                 ...                   ...            ...     ...
79262    9/5/1960 21:00               buffalo             ny      us
79668    9/7/1958 19:00                arthur             nd      us
80101    9/9/1952 20:00          philadelphia             pa      us
80102    9/9/1954 12:30              beaumont             tx      us
80103    9/9/1956 05:55               norfolk             va      us

      UFO_shape length_of_encounter_seconds described_duration_of_encounter  \
2        circle                          20                      20 seconds
3        circle                          20                        1/2 hour
480        disk                        1200                   about 20 mins
481        disk                          90                         90 sec.
482      circle                          60                        1 minute
...         ...                         ...                             ...
79262      oval                       180.0                       3 minutes
79668   unknown                       900.0                       5-15 min.
80101    circle                       180.0                       3 minutes
80102      disk                       300.0                       5 minutes
80103     cigar                        90.0                     1.5 minutes

                                             description date_documented  \
2      Green/Orange circular disc over Chester&#44 En...       1/21/2008
3      My older brother and twin sister were leaving ...       1/17/2004
480    UFO seen by multiple U. S. military personnel;...       12/7/2006
481    1952 daylight sighting of multiple discs in fo...      10/31/2008
482    I saw the craft go across the horizon.  It app...       4/12/2013
...                                                  ...             ...
79262  Precise movements of a &quot;craft&quot; appar...       9/15/2005
79668  Two lights of alternating color traveling and ...      10/31/2003
80101                   saucers in a line over Phila Pa.      12/12/2009
80102  Aprox. 30 Disk shaped UFOs fell out of clouds ...       1/17/2004
80103  Unidentified Object Hovering over Interstate 2...       2/24/2007

         latitude   longitude
2            53.2   -2.916667
3      28.9783333  -96.645833
480     33.590355  130.401716
481    39.0997222  -94.578333
482    38.7230556  -80.650000
...           ...         ...
79262   42.886389  -78.878611
79668   47.104167  -97.217778
80101   39.952222  -75.164167
80102   30.085833  -94.101667
80103   36.846667  -76.285556

[465 rows x 11 columns]